###################################################################

# Created by write_sdc on Sun Aug  2 20:25:53 2020

###################################################################
set sdc_version 2.0

set_units -time ns -resistance kOhm -capacitance pF -voltage V -current mA
set_operating_conditions slow -library slow
set_wire_load_model -name tsmc13_wl10 -library slow
set_load -pin_load 1 [get_ports done]
set_load -pin_load 1 [get_ports {ps_ra[15]}]
set_load -pin_load 1 [get_ports {ps_ra[14]}]
set_load -pin_load 1 [get_ports {ps_ra[13]}]
set_load -pin_load 1 [get_ports {ps_ra[12]}]
set_load -pin_load 1 [get_ports {ps_ra[11]}]
set_load -pin_load 1 [get_ports {ps_ra[10]}]
set_load -pin_load 1 [get_ports {ps_ra[9]}]
set_load -pin_load 1 [get_ports {ps_ra[8]}]
set_load -pin_load 1 [get_ports {ps_ra[7]}]
set_load -pin_load 1 [get_ports {ps_ra[6]}]
set_load -pin_load 1 [get_ports {ps_ra[5]}]
set_load -pin_load 1 [get_ports {ps_ra[4]}]
set_load -pin_load 1 [get_ports {ps_ra[3]}]
set_load -pin_load 1 [get_ports {ps_ra[2]}]
set_load -pin_load 1 [get_ports {ps_ra[1]}]
set_load -pin_load 1 [get_ports {ps_ra[0]}]
set_load -pin_load 1 [get_ports {in_ad[15]}]
set_load -pin_load 1 [get_ports {in_ad[14]}]
set_load -pin_load 1 [get_ports {in_ad[13]}]
set_load -pin_load 1 [get_ports {in_ad[12]}]
set_load -pin_load 1 [get_ports {in_ad[11]}]
set_load -pin_load 1 [get_ports {in_ad[10]}]
set_load -pin_load 1 [get_ports {in_ad[9]}]
set_load -pin_load 1 [get_ports {in_ad[8]}]
set_load -pin_load 1 [get_ports {in_ad[7]}]
set_load -pin_load 1 [get_ports {in_ad[6]}]
set_load -pin_load 1 [get_ports {in_ad[5]}]
set_load -pin_load 1 [get_ports {in_ad[4]}]
set_load -pin_load 1 [get_ports {in_ad[3]}]
set_load -pin_load 1 [get_ports {in_ad[2]}]
set_load -pin_load 1 [get_ports {in_ad[1]}]
set_load -pin_load 1 [get_ports {in_ad[0]}]
set_load -pin_load 1 [get_ports in_we]
set_load -pin_load 1 [get_ports {in_wd[7]}]
set_load -pin_load 1 [get_ports {in_wd[6]}]
set_load -pin_load 1 [get_ports {in_wd[5]}]
set_load -pin_load 1 [get_ports {in_wd[4]}]
set_load -pin_load 1 [get_ports {in_wd[3]}]
set_load -pin_load 1 [get_ports {in_wd[2]}]
set_load -pin_load 1 [get_ports {in_wd[1]}]
set_load -pin_load 1 [get_ports {in_wd[0]}]
set_load -pin_load 1 [get_ports {w_ra[15]}]
set_load -pin_load 1 [get_ports {w_ra[14]}]
set_load -pin_load 1 [get_ports {w_ra[13]}]
set_load -pin_load 1 [get_ports {w_ra[12]}]
set_load -pin_load 1 [get_ports {w_ra[11]}]
set_load -pin_load 1 [get_ports {w_ra[10]}]
set_load -pin_load 1 [get_ports {w_ra[9]}]
set_load -pin_load 1 [get_ports {w_ra[8]}]
set_load -pin_load 1 [get_ports {w_ra[7]}]
set_load -pin_load 1 [get_ports {w_ra[6]}]
set_load -pin_load 1 [get_ports {w_ra[5]}]
set_load -pin_load 1 [get_ports {w_ra[4]}]
set_load -pin_load 1 [get_ports {w_ra[3]}]
set_load -pin_load 1 [get_ports {w_ra[2]}]
set_load -pin_load 1 [get_ports {w_ra[1]}]
set_load -pin_load 1 [get_ports {w_ra[0]}]
set_load -pin_load 1 [get_ports {b_ra[15]}]
set_load -pin_load 1 [get_ports {b_ra[14]}]
set_load -pin_load 1 [get_ports {b_ra[13]}]
set_load -pin_load 1 [get_ports {b_ra[12]}]
set_load -pin_load 1 [get_ports {b_ra[11]}]
set_load -pin_load 1 [get_ports {b_ra[10]}]
set_load -pin_load 1 [get_ports {b_ra[9]}]
set_load -pin_load 1 [get_ports {b_ra[8]}]
set_load -pin_load 1 [get_ports {b_ra[7]}]
set_load -pin_load 1 [get_ports {b_ra[6]}]
set_load -pin_load 1 [get_ports {b_ra[5]}]
set_load -pin_load 1 [get_ports {b_ra[4]}]
set_load -pin_load 1 [get_ports {b_ra[3]}]
set_load -pin_load 1 [get_ports {b_ra[2]}]
set_load -pin_load 1 [get_ports {b_ra[1]}]
set_load -pin_load 1 [get_ports {b_ra[0]}]
set_load -pin_load 1 [get_ports {out_ad[15]}]
set_load -pin_load 1 [get_ports {out_ad[14]}]
set_load -pin_load 1 [get_ports {out_ad[13]}]
set_load -pin_load 1 [get_ports {out_ad[12]}]
set_load -pin_load 1 [get_ports {out_ad[11]}]
set_load -pin_load 1 [get_ports {out_ad[10]}]
set_load -pin_load 1 [get_ports {out_ad[9]}]
set_load -pin_load 1 [get_ports {out_ad[8]}]
set_load -pin_load 1 [get_ports {out_ad[7]}]
set_load -pin_load 1 [get_ports {out_ad[6]}]
set_load -pin_load 1 [get_ports {out_ad[5]}]
set_load -pin_load 1 [get_ports {out_ad[4]}]
set_load -pin_load 1 [get_ports {out_ad[3]}]
set_load -pin_load 1 [get_ports {out_ad[2]}]
set_load -pin_load 1 [get_ports {out_ad[1]}]
set_load -pin_load 1 [get_ports {out_ad[0]}]
set_load -pin_load 1 [get_ports out_we]
set_load -pin_load 1 [get_ports {out_wd[7]}]
set_load -pin_load 1 [get_ports {out_wd[6]}]
set_load -pin_load 1 [get_ports {out_wd[5]}]
set_load -pin_load 1 [get_ports {out_wd[4]}]
set_load -pin_load 1 [get_ports {out_wd[3]}]
set_load -pin_load 1 [get_ports {out_wd[2]}]
set_load -pin_load 1 [get_ports {out_wd[1]}]
set_load -pin_load 1 [get_ports {out_wd[0]}]
set_max_fanout 20 [get_ports clk]
set_max_fanout 20 [get_ports rst]
set_max_fanout 20 [get_ports en]
set_max_fanout 20 [get_ports {ps_rd[7]}]
set_max_fanout 20 [get_ports {ps_rd[6]}]
set_max_fanout 20 [get_ports {ps_rd[5]}]
set_max_fanout 20 [get_ports {ps_rd[4]}]
set_max_fanout 20 [get_ports {ps_rd[3]}]
set_max_fanout 20 [get_ports {ps_rd[2]}]
set_max_fanout 20 [get_ports {ps_rd[1]}]
set_max_fanout 20 [get_ports {ps_rd[0]}]
set_max_fanout 20 [get_ports {in_rd[7]}]
set_max_fanout 20 [get_ports {in_rd[6]}]
set_max_fanout 20 [get_ports {in_rd[5]}]
set_max_fanout 20 [get_ports {in_rd[4]}]
set_max_fanout 20 [get_ports {in_rd[3]}]
set_max_fanout 20 [get_ports {in_rd[2]}]
set_max_fanout 20 [get_ports {in_rd[1]}]
set_max_fanout 20 [get_ports {in_rd[0]}]
set_max_fanout 20 [get_ports {w_rd[7]}]
set_max_fanout 20 [get_ports {w_rd[6]}]
set_max_fanout 20 [get_ports {w_rd[5]}]
set_max_fanout 20 [get_ports {w_rd[4]}]
set_max_fanout 20 [get_ports {w_rd[3]}]
set_max_fanout 20 [get_ports {w_rd[2]}]
set_max_fanout 20 [get_ports {w_rd[1]}]
set_max_fanout 20 [get_ports {w_rd[0]}]
set_max_fanout 20 [get_ports {b_rd[7]}]
set_max_fanout 20 [get_ports {b_rd[6]}]
set_max_fanout 20 [get_ports {b_rd[5]}]
set_max_fanout 20 [get_ports {b_rd[4]}]
set_max_fanout 20 [get_ports {b_rd[3]}]
set_max_fanout 20 [get_ports {b_rd[2]}]
set_max_fanout 20 [get_ports {b_rd[1]}]
set_max_fanout 20 [get_ports {b_rd[0]}]
set_max_fanout 20 [get_ports {out_rd[7]}]
set_max_fanout 20 [get_ports {out_rd[6]}]
set_max_fanout 20 [get_ports {out_rd[5]}]
set_max_fanout 20 [get_ports {out_rd[4]}]
set_max_fanout 20 [get_ports {out_rd[3]}]
set_max_fanout 20 [get_ports {out_rd[2]}]
set_max_fanout 20 [get_ports {out_rd[1]}]
set_max_fanout 20 [get_ports {out_rd[0]}]
set_ideal_network [get_ports clk]
create_clock [get_ports clk]  -period 15  -waveform {0 7.5}
set_clock_latency 0.5  [get_clocks clk]
set_clock_uncertainty 0.1  [get_clocks clk]
set_input_delay -clock clk  5  [get_ports rst]
set_input_delay -clock clk  5  [get_ports en]
set_input_delay -clock clk  5  [get_ports {ps_rd[7]}]
set_input_delay -clock clk  5  [get_ports {ps_rd[6]}]
set_input_delay -clock clk  5  [get_ports {ps_rd[5]}]
set_input_delay -clock clk  5  [get_ports {ps_rd[4]}]
set_input_delay -clock clk  5  [get_ports {ps_rd[3]}]
set_input_delay -clock clk  5  [get_ports {ps_rd[2]}]
set_input_delay -clock clk  5  [get_ports {ps_rd[1]}]
set_input_delay -clock clk  5  [get_ports {ps_rd[0]}]
set_input_delay -clock clk  5  [get_ports {in_rd[7]}]
set_input_delay -clock clk  5  [get_ports {in_rd[6]}]
set_input_delay -clock clk  5  [get_ports {in_rd[5]}]
set_input_delay -clock clk  5  [get_ports {in_rd[4]}]
set_input_delay -clock clk  5  [get_ports {in_rd[3]}]
set_input_delay -clock clk  5  [get_ports {in_rd[2]}]
set_input_delay -clock clk  5  [get_ports {in_rd[1]}]
set_input_delay -clock clk  5  [get_ports {in_rd[0]}]
set_input_delay -clock clk  5  [get_ports {w_rd[7]}]
set_input_delay -clock clk  5  [get_ports {w_rd[6]}]
set_input_delay -clock clk  5  [get_ports {w_rd[5]}]
set_input_delay -clock clk  5  [get_ports {w_rd[4]}]
set_input_delay -clock clk  5  [get_ports {w_rd[3]}]
set_input_delay -clock clk  5  [get_ports {w_rd[2]}]
set_input_delay -clock clk  5  [get_ports {w_rd[1]}]
set_input_delay -clock clk  5  [get_ports {w_rd[0]}]
set_input_delay -clock clk  5  [get_ports {b_rd[7]}]
set_input_delay -clock clk  5  [get_ports {b_rd[6]}]
set_input_delay -clock clk  5  [get_ports {b_rd[5]}]
set_input_delay -clock clk  5  [get_ports {b_rd[4]}]
set_input_delay -clock clk  5  [get_ports {b_rd[3]}]
set_input_delay -clock clk  5  [get_ports {b_rd[2]}]
set_input_delay -clock clk  5  [get_ports {b_rd[1]}]
set_input_delay -clock clk  5  [get_ports {b_rd[0]}]
set_input_delay -clock clk  5  [get_ports {out_rd[7]}]
set_input_delay -clock clk  5  [get_ports {out_rd[6]}]
set_input_delay -clock clk  5  [get_ports {out_rd[5]}]
set_input_delay -clock clk  5  [get_ports {out_rd[4]}]
set_input_delay -clock clk  5  [get_ports {out_rd[3]}]
set_input_delay -clock clk  5  [get_ports {out_rd[2]}]
set_input_delay -clock clk  5  [get_ports {out_rd[1]}]
set_input_delay -clock clk  5  [get_ports {out_rd[0]}]
set_output_delay -clock clk  0.5  [get_ports done]
set_output_delay -clock clk  0.5  [get_ports {ps_ra[15]}]
set_output_delay -clock clk  0.5  [get_ports {ps_ra[14]}]
set_output_delay -clock clk  0.5  [get_ports {ps_ra[13]}]
set_output_delay -clock clk  0.5  [get_ports {ps_ra[12]}]
set_output_delay -clock clk  0.5  [get_ports {ps_ra[11]}]
set_output_delay -clock clk  0.5  [get_ports {ps_ra[10]}]
set_output_delay -clock clk  0.5  [get_ports {ps_ra[9]}]
set_output_delay -clock clk  0.5  [get_ports {ps_ra[8]}]
set_output_delay -clock clk  0.5  [get_ports {ps_ra[7]}]
set_output_delay -clock clk  0.5  [get_ports {ps_ra[6]}]
set_output_delay -clock clk  0.5  [get_ports {ps_ra[5]}]
set_output_delay -clock clk  0.5  [get_ports {ps_ra[4]}]
set_output_delay -clock clk  0.5  [get_ports {ps_ra[3]}]
set_output_delay -clock clk  0.5  [get_ports {ps_ra[2]}]
set_output_delay -clock clk  0.5  [get_ports {ps_ra[1]}]
set_output_delay -clock clk  0.5  [get_ports {ps_ra[0]}]
set_output_delay -clock clk  0.5  [get_ports {in_ad[15]}]
set_output_delay -clock clk  0.5  [get_ports {in_ad[14]}]
set_output_delay -clock clk  0.5  [get_ports {in_ad[13]}]
set_output_delay -clock clk  0.5  [get_ports {in_ad[12]}]
set_output_delay -clock clk  0.5  [get_ports {in_ad[11]}]
set_output_delay -clock clk  0.5  [get_ports {in_ad[10]}]
set_output_delay -clock clk  0.5  [get_ports {in_ad[9]}]
set_output_delay -clock clk  0.5  [get_ports {in_ad[8]}]
set_output_delay -clock clk  0.5  [get_ports {in_ad[7]}]
set_output_delay -clock clk  0.5  [get_ports {in_ad[6]}]
set_output_delay -clock clk  0.5  [get_ports {in_ad[5]}]
set_output_delay -clock clk  0.5  [get_ports {in_ad[4]}]
set_output_delay -clock clk  0.5  [get_ports {in_ad[3]}]
set_output_delay -clock clk  0.5  [get_ports {in_ad[2]}]
set_output_delay -clock clk  0.5  [get_ports {in_ad[1]}]
set_output_delay -clock clk  0.5  [get_ports {in_ad[0]}]
set_output_delay -clock clk  0.5  [get_ports in_we]
set_output_delay -clock clk  0.5  [get_ports {in_wd[7]}]
set_output_delay -clock clk  0.5  [get_ports {in_wd[6]}]
set_output_delay -clock clk  0.5  [get_ports {in_wd[5]}]
set_output_delay -clock clk  0.5  [get_ports {in_wd[4]}]
set_output_delay -clock clk  0.5  [get_ports {in_wd[3]}]
set_output_delay -clock clk  0.5  [get_ports {in_wd[2]}]
set_output_delay -clock clk  0.5  [get_ports {in_wd[1]}]
set_output_delay -clock clk  0.5  [get_ports {in_wd[0]}]
set_output_delay -clock clk  0.5  [get_ports {w_ra[15]}]
set_output_delay -clock clk  0.5  [get_ports {w_ra[14]}]
set_output_delay -clock clk  0.5  [get_ports {w_ra[13]}]
set_output_delay -clock clk  0.5  [get_ports {w_ra[12]}]
set_output_delay -clock clk  0.5  [get_ports {w_ra[11]}]
set_output_delay -clock clk  0.5  [get_ports {w_ra[10]}]
set_output_delay -clock clk  0.5  [get_ports {w_ra[9]}]
set_output_delay -clock clk  0.5  [get_ports {w_ra[8]}]
set_output_delay -clock clk  0.5  [get_ports {w_ra[7]}]
set_output_delay -clock clk  0.5  [get_ports {w_ra[6]}]
set_output_delay -clock clk  0.5  [get_ports {w_ra[5]}]
set_output_delay -clock clk  0.5  [get_ports {w_ra[4]}]
set_output_delay -clock clk  0.5  [get_ports {w_ra[3]}]
set_output_delay -clock clk  0.5  [get_ports {w_ra[2]}]
set_output_delay -clock clk  0.5  [get_ports {w_ra[1]}]
set_output_delay -clock clk  0.5  [get_ports {w_ra[0]}]
set_output_delay -clock clk  0.5  [get_ports {b_ra[15]}]
set_output_delay -clock clk  0.5  [get_ports {b_ra[14]}]
set_output_delay -clock clk  0.5  [get_ports {b_ra[13]}]
set_output_delay -clock clk  0.5  [get_ports {b_ra[12]}]
set_output_delay -clock clk  0.5  [get_ports {b_ra[11]}]
set_output_delay -clock clk  0.5  [get_ports {b_ra[10]}]
set_output_delay -clock clk  0.5  [get_ports {b_ra[9]}]
set_output_delay -clock clk  0.5  [get_ports {b_ra[8]}]
set_output_delay -clock clk  0.5  [get_ports {b_ra[7]}]
set_output_delay -clock clk  0.5  [get_ports {b_ra[6]}]
set_output_delay -clock clk  0.5  [get_ports {b_ra[5]}]
set_output_delay -clock clk  0.5  [get_ports {b_ra[4]}]
set_output_delay -clock clk  0.5  [get_ports {b_ra[3]}]
set_output_delay -clock clk  0.5  [get_ports {b_ra[2]}]
set_output_delay -clock clk  0.5  [get_ports {b_ra[1]}]
set_output_delay -clock clk  0.5  [get_ports {b_ra[0]}]
set_output_delay -clock clk  0.5  [get_ports {out_ad[15]}]
set_output_delay -clock clk  0.5  [get_ports {out_ad[14]}]
set_output_delay -clock clk  0.5  [get_ports {out_ad[13]}]
set_output_delay -clock clk  0.5  [get_ports {out_ad[12]}]
set_output_delay -clock clk  0.5  [get_ports {out_ad[11]}]
set_output_delay -clock clk  0.5  [get_ports {out_ad[10]}]
set_output_delay -clock clk  0.5  [get_ports {out_ad[9]}]
set_output_delay -clock clk  0.5  [get_ports {out_ad[8]}]
set_output_delay -clock clk  0.5  [get_ports {out_ad[7]}]
set_output_delay -clock clk  0.5  [get_ports {out_ad[6]}]
set_output_delay -clock clk  0.5  [get_ports {out_ad[5]}]
set_output_delay -clock clk  0.5  [get_ports {out_ad[4]}]
set_output_delay -clock clk  0.5  [get_ports {out_ad[3]}]
set_output_delay -clock clk  0.5  [get_ports {out_ad[2]}]
set_output_delay -clock clk  0.5  [get_ports {out_ad[1]}]
set_output_delay -clock clk  0.5  [get_ports {out_ad[0]}]
set_output_delay -clock clk  0.5  [get_ports out_we]
set_output_delay -clock clk  0.5  [get_ports {out_wd[7]}]
set_output_delay -clock clk  0.5  [get_ports {out_wd[6]}]
set_output_delay -clock clk  0.5  [get_ports {out_wd[5]}]
set_output_delay -clock clk  0.5  [get_ports {out_wd[4]}]
set_output_delay -clock clk  0.5  [get_ports {out_wd[3]}]
set_output_delay -clock clk  0.5  [get_ports {out_wd[2]}]
set_output_delay -clock clk  0.5  [get_ports {out_wd[1]}]
set_output_delay -clock clk  0.5  [get_ports {out_wd[0]}]
set_drive 1  [get_ports clk]
set_drive 1  [get_ports rst]
set_drive 1  [get_ports en]
set_drive 1  [get_ports {ps_rd[7]}]
set_drive 1  [get_ports {ps_rd[6]}]
set_drive 1  [get_ports {ps_rd[5]}]
set_drive 1  [get_ports {ps_rd[4]}]
set_drive 1  [get_ports {ps_rd[3]}]
set_drive 1  [get_ports {ps_rd[2]}]
set_drive 1  [get_ports {ps_rd[1]}]
set_drive 1  [get_ports {ps_rd[0]}]
set_drive 1  [get_ports {in_rd[7]}]
set_drive 1  [get_ports {in_rd[6]}]
set_drive 1  [get_ports {in_rd[5]}]
set_drive 1  [get_ports {in_rd[4]}]
set_drive 1  [get_ports {in_rd[3]}]
set_drive 1  [get_ports {in_rd[2]}]
set_drive 1  [get_ports {in_rd[1]}]
set_drive 1  [get_ports {in_rd[0]}]
set_drive 1  [get_ports {w_rd[7]}]
set_drive 1  [get_ports {w_rd[6]}]
set_drive 1  [get_ports {w_rd[5]}]
set_drive 1  [get_ports {w_rd[4]}]
set_drive 1  [get_ports {w_rd[3]}]
set_drive 1  [get_ports {w_rd[2]}]
set_drive 1  [get_ports {w_rd[1]}]
set_drive 1  [get_ports {w_rd[0]}]
set_drive 1  [get_ports {b_rd[7]}]
set_drive 1  [get_ports {b_rd[6]}]
set_drive 1  [get_ports {b_rd[5]}]
set_drive 1  [get_ports {b_rd[4]}]
set_drive 1  [get_ports {b_rd[3]}]
set_drive 1  [get_ports {b_rd[2]}]
set_drive 1  [get_ports {b_rd[1]}]
set_drive 1  [get_ports {b_rd[0]}]
set_drive 1  [get_ports {out_rd[7]}]
set_drive 1  [get_ports {out_rd[6]}]
set_drive 1  [get_ports {out_rd[5]}]
set_drive 1  [get_ports {out_rd[4]}]
set_drive 1  [get_ports {out_rd[3]}]
set_drive 1  [get_ports {out_rd[2]}]
set_drive 1  [get_ports {out_rd[1]}]
set_drive 1  [get_ports {out_rd[0]}]
